/> disk_add ../img/xfs_v4_ftype1_s05k_b2k_n8k.img hd0
/hd0/1: xfs
/> stat /hd0/1/sf/.
status = 0 success
attr: ----f
/> stat /hd0/1/sf/..
status = 0 success
attr: ----f
/> stat /hd0/1/sf///
status = 0 success
attr: ----f
/> stat /hd0/1/sf///.
status = 0 success
attr: ----f
/> stat /hd0/1/sf///..
status = 0 success
attr: ----f
/> stat /hd0/1/sf/../sf
status = 0 success
attr: ----f
/> stat /hd0/1/sf/../sf/
status = 0 success
attr: ----f
#stat /hd0/1/sf///..//sf
#stat /hd0/1/sf///..//sf/

/> stat /hd0/1/sf/d0000000000_
status = 0 success
attr: ----f
/> stat /hd0/1/sf/d0000000001_x
status = 0 success
attr: ----f
/> stat /hd0/1/sf/d0000000002_xx
status = 0 success
attr: ----f
/> stat /hd0/1/sf/d0000000003_xxx
status = 5 file_not_found

/> cd /hd0/1/sf
sf> stat .
status = 0 success
attr: ----f
sf> stat ..
status = 0 success
attr: ----f
sf> stat d0000000001_x
status = 0 success
attr: ----f
sf> stat d0000000002_xx
status = 0 success
attr: ----f
sf> stat d0000000003_xxx
status = 5 file_not_found

sf> cd /hd0/1/block
block> stat .
status = 0 success
attr: ----f
block> stat ..
status = 0 success
attr: ----f
block> stat d0000000000_xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
status = 0 success
attr: ----f
block> stat d0000000001_xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
status = 0 success
attr: ----f
block> stat d0000000002_xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
status = 0 success
attr: ----f
block> stat d0000000003_xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
status = 0 success
attr: ----f
block> stat d0000000004_xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
status = 0 success
attr: ----f
block> stat d0000000005_xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
status = 5 file_not_found

block> disk_del hd0
